haohaoxinsheng/ESP32_ELDER_MONITOR/src/main.cpp
#include <Arduino.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <BH1750.h>
#include <DHT.h>
#include <ESP32Servo.h>

#include "config.h"
#include "cloud/aliyun_client.h"
#include "cloud/cloud_config.h"
#include "devices/actuator_config.h"
#include "devices/bh1750_config.h"
#include "devices/dht22_config.h"
#include "devices/fsr402_config.h"
#include "devices/mq2_config.h"
#include "devices/mq135_config.h"
#include "devices/mq7_config.h"
#include "devices/oled_config.h"
#include "devices/onboard_rgb_status.h"
#include "devices/pir_config.h"
#include "devices/sos_button_config.h"
#include "devices/sw420_config.h"
#include "telemetry_payload.h"

// 全局静态对象：OLED 显示、光照传感器、温湿度传感器、舵机
namespace {
Adafruit_SSD1306 display(OledConfig::WIDTH, OledConfig::HEIGHT, &Wire, OledConfig::RESET_PIN);
BH1750 lightMeter;
TwoWire bh1750Wire(1);
DHT dht(Dht22Config::DATA_PIN, Dht22Config::TYPE);
Servo servo;

// 传感器数据结构：保存当前读取到的环境与状态信息
struct SensorData {
  float temperatureC = NAN;
  float humidity = NAN;
  float lux = NAN;
  uint16_t mq2Raw = 0;
  uint16_t mq135Raw = 0;
  uint16_t mq7Raw = 0;
  uint16_t fsrRaw = 0;
  uint16_t vibrationRaw = 0;
  bool pirMotion = false;
  bool vibration = false;
  bool sos = false;
};

// 警报状态结构：根据传感器数据判断各种告警与危险等级
struct AlarmState {
  bool airWarning = false;
  bool airDanger = false;
  bool smokeWarning = false;
  bool smokeDanger = false;
  bool coWarning = false;
  bool coDanger = false;
  bool tempHumidity = false;
  bool tempLow = false;
  bool humidityLow = false;
  bool pressure = false;
  bool vibration = false;
  bool noMotion = false;
  bool fallDetected = false;
  bool sos = false;
  bool any = false;
  bool critical = false;
  bool pushRequired = false;
};

// 活动状态结构：用于检测是否处于夜间活动状态
struct ActivityState {
  bool dark = false;
  bool nightActivity = false;
};

SensorData data;
AlarmState alarmState;
ActivityState activityState;

uint32_t lastSensorReadMs = 0;
uint32_t lastDisplayMs = 0;
uint32_t lastSerialMs = 0;
uint32_t lastMotionMs = 0;
uint32_t lastNightActivityMs = 0;
uint32_t lastVibrationMs = 0;
uint32_t lastBeepToggleMs = 0;
uint32_t lastLedBlinkMs = 0;
bool buzzerOn = false;
bool lastAlarmAny = false;
bool ledBlinkOn = false;
bool lastSosReading = HIGH;
bool stableSosState = HIGH;
uint32_t lastSosChangeMs = 0;
uint32_t lastCloudPublishMs = 0;
bool nightActivitySeen = false;

bool oledOk = false;
bool bh1750Ok = false;
bool fanOn = false;
bool ledOn = false;
bool darkLightOn = false;
bool nightLightOn = false;
bool nightWakeLightOn = false;
bool alarmLightOn = false;

void setBuzzer(bool on) {
  buzzerOn = on;
  if (ActuatorConfig::BUZZER_IS_ACTIVE) {
    const uint8_t activeLevel = ActuatorConfig::BUZZER_ACTIVE_HIGH ? HIGH : LOW;
    const uint8_t inactiveLevel = ActuatorConfig::BUZZER_ACTIVE_HIGH ? LOW : HIGH;
    digitalWrite(ActuatorConfig::BUZZER_PIN, on ? activeLevel : inactiveLevel);
    return;
  }

  if (on) {
    tone(ActuatorConfig::BUZZER_PIN, ActuatorConfig::PASSIVE_BUZZER_FREQUENCY_HZ);
  } else {
    noTone(ActuatorConfig::BUZZER_PIN);
  }
}

void setLedLight(bool on) {
  const uint8_t activeLevel = ActuatorConfig::LED_LIGHT_ACTIVE_HIGH ? HIGH : LOW;
  const uint8_t inactiveLevel = ActuatorConfig::LED_LIGHT_ACTIVE_HIGH ? LOW : HIGH;
  digitalWrite(ActuatorConfig::LED_LIGHT_PIN, on ? activeLevel : inactiveLevel);
}

bool isBedOccupied(const DeviceControlState& controls) {
  return controls.enableFsr && data.fsrRaw >= Fsr402Config::BED_OCCUPIED_RAW;
}

bool isVentilationNeeded() {
  return alarmState.airDanger || alarmState.smokeWarning ||
         alarmState.coWarning || alarmState.tempHumidity;
}

// SOS 按键去抖：读取按键状态并保证稳定后返回按下状态
bool buttonPressed() {
  const bool reading = digitalRead(SosButtonConfig::PIN);
  const uint32_t now = millis();

  if (reading != lastSosReading) {
    lastSosChangeMs = now;
    lastSosReading = reading;
  }

  if ((now - lastSosChangeMs) > SosButtonConfig::DEBOUNCE_MS) {
    stableSosState = reading;
  }

  return stableSosState == LOW;
}

// 读取全部传感器值并保存到数据结构中
void readSensors() {
  const DeviceControlState& controls = AliyunClient::controlState();
  data.temperatureC = controls.enableDht22 ? dht.readTemperature() : NAN;
  data.humidity = controls.enableDht22 ? dht.readHumidity() : NAN;
  data.lux = controls.enableBh1750 && bh1750Ok ? lightMeter.readLightLevel() : NAN;
  if (data.lux < 0) {
    data.lux = NAN;
  }
  data.mq2Raw = controls.enableMq2 ? analogRead(Mq2Config::AOUT_PIN) : 0;
  data.mq135Raw = controls.enableMq135 ? analogRead(Mq135Config::AOUT_PIN) : 0;
  data.mq7Raw = controls.enableMq7 ? analogRead(Mq7Config::AOUT_PIN) : 0;
  data.fsrRaw = controls.enableFsr ? analogRead(Fsr402Config::AOUT_PIN) : 0;
  data.pirMotion = controls.enablePir && digitalRead(PirConfig::OUT_PIN) == HIGH;
  data.vibration = controls.enableSw420 && digitalRead(Sw420Config::DOUT_PIN) == HIGH;
  data.vibrationRaw = data.vibration ? 4095 : 0;
  data.sos = controls.enableSos && buttonPressed();

  if (data.pirMotion) {
    lastMotionMs = millis();
  }

  if (data.vibration) {
    lastVibrationMs = millis();
  }
}

// 更新夜间活动状态：若光照暗且有人移动，则保持夜间活动标记
void updateActivityState() {
  const uint32_t now = millis();
  const DeviceControlState& controls = AliyunClient::controlState();
  activityState.dark = controls.enableBh1750 && !isnan(data.lux) && data.lux <= Bh1750Config::NIGHT_ACTIVITY_LUX;

  if (controls.enablePir && activityState.dark && data.pirMotion) {
    lastNightActivityMs = now;
    nightActivitySeen = true;
  }

  activityState.nightActivity =
      activityState.dark && nightActivitySeen &&
      (now - lastNightActivityMs <= Timing::NIGHT_LIGHT_HOLD_MS);
}

void updateGasAlarms(const DeviceControlState& controls) {
  alarmState.airWarning = controls.enableMq135 && data.mq135Raw >= Mq135Config::WARN_RAW;
  alarmState.airDanger = controls.enableMq135 && data.mq135Raw >= Mq135Config::DANGER_RAW;
  alarmState.smokeWarning = controls.enableMq2 && data.mq2Raw >= Mq2Config::WARN_RAW;
  alarmState.smokeDanger = controls.enableMq2 && data.mq2Raw >= Mq2Config::DANGER_RAW;
  alarmState.coWarning = controls.enableMq7 && data.mq7Raw >= Mq7Config::WARN_RAW;
  alarmState.coDanger = controls.enableMq7 && data.mq7Raw >= Mq7Config::DANGER_RAW;
}

void updateComfortAlarms(const DeviceControlState& controls) {
  alarmState.tempHumidity =
      controls.enableDht22 &&
      ((!isnan(data.temperatureC) && data.temperatureC >= Dht22Config::TEMP_HIGH_C) ||
       (!isnan(data.humidity) && data.humidity >= Dht22Config::HUMIDITY_HIGH_PERCENT));
  alarmState.tempLow = controls.enableDht22 && !isnan(data.temperatureC) && data.temperatureC <= Dht22Config::TEMP_LOW_C;
  alarmState.humidityLow = controls.enableDht22 && !isnan(data.humidity) && data.humidity <= Dht22Config::HUMIDITY_LOW_PERCENT;
}

void updateActivityAlarms(const DeviceControlState& controls, uint32_t now) {
  alarmState.pressure = controls.enableFsr && data.fsrRaw >= Fsr402Config::PRESS_WARN_RAW;
  alarmState.vibration = controls.enableSw420 && data.vibration;
  alarmState.noMotion = controls.noMotionWarning && (now - lastMotionMs) >= Timing::NO_MOTION_WARNING_MS;
  alarmState.fallDetected =
      alarmState.pressure &&
      (now - lastVibrationMs <= Timing::FALL_VIBRATION_WINDOW_MS) &&
      (now - lastMotionMs >= Timing::FALL_NO_MOTION_MS);
  // 只有在检测到压力、振动和长时间无运动时才判定为跌倒
  alarmState.sos = controls.enableSos && data.sos;
}

