haohaoxinsheng/ESP32_ELDER_MONITOR/src/main.cpp
void finalizeAlarmState() {
  alarmState.critical = alarmState.coDanger || alarmState.fallDetected || alarmState.sos;
  alarmState.pushRequired = alarmState.critical || alarmState.airDanger || alarmState.smokeDanger || alarmState.noMotion;
  alarmState.any = alarmState.airWarning || alarmState.airDanger ||
                   alarmState.smokeWarning || alarmState.smokeDanger ||
                   alarmState.coWarning || alarmState.coDanger || alarmState.tempHumidity ||
                   alarmState.tempLow || alarmState.humidityLow ||
                   alarmState.pressure || alarmState.vibration ||
                   alarmState.noMotion || alarmState.fallDetected || alarmState.sos;
}

void updateAlarmState() {
  const uint32_t now = millis();
  const DeviceControlState& controls = AliyunClient::controlState();
  updateGasAlarms(controls);
  updateComfortAlarms(controls);
  updateActivityAlarms(controls, now);
  finalizeAlarmState();
}

void updateFan(const DeviceControlState& controls) {
  fanOn = isVentilationNeeded() && controls.fanVentilation;
  digitalWrite(ActuatorConfig::FAN_RELAY_PIN, fanOn ? HIGH : LOW);
}

void updateLighting(const DeviceControlState& controls) {
  const bool bedOccupied = isBedOccupied(controls);
  darkLightOn = controls.darkLight && activityState.dark;
  nightLightOn = controls.nightLight && activityState.nightActivity;
  nightWakeLightOn = controls.nightWakeLight && controls.enablePir && activityState.dark && !bedOccupied && data.pirMotion;
  alarmLightOn = controls.alarmLight && alarmState.any;
  ledOn = darkLightOn || nightLightOn || nightWakeLightOn || alarmLightOn;
  if (alarmState.critical && controls.alarmLight) {
    const uint32_t now = millis();
    if (now - lastLedBlinkMs >= Timing::CRITICAL_BLINK_INTERVAL_MS) {
      lastLedBlinkMs = now;
      ledBlinkOn = !ledBlinkOn;
    }
    setLedLight(ledBlinkOn);
  } else {
    setLedLight(ledOn);
  }
}

void updateServoPosition(const DeviceControlState& controls) {
  if (alarmState.sos && controls.sosServo) {
    servo.write(ActuatorConfig::SERVO_SOS_ANGLE);
  } else if (activityState.dark && controls.curtainAuto) {
    servo.write(ActuatorConfig::SERVO_CURTAIN_CLOSED_ANGLE);
  } else {
    servo.write(ActuatorConfig::SERVO_NORMAL_ANGLE);
  }
}

void updateBuzzerAlarm(const DeviceControlState& controls) {
  if (!alarmState.any || !controls.buzzerAlarm) {
    setBuzzer(false);
    lastAlarmAny = false;
    return;
  }
  // 仅在有警报时才进入蜂鸣与报警逻辑

  if (!lastAlarmAny) {
    lastAlarmAny = true;
    lastBeepToggleMs = millis();
    setBuzzer(true);
  }

  if (alarmState.coDanger || alarmState.smokeDanger) {
    setBuzzer(true);
    return;
  }

  const uint32_t now = millis();
  const uint32_t interval = alarmState.critical ? Timing::ALERT_BEEP_INTERVAL_MS : Timing::WARNING_BEEP_INTERVAL_MS;
  if (now - lastBeepToggleMs >= interval) {
    lastBeepToggleMs = now;
    setBuzzer(!buzzerOn);
  }
}

// 控制执行器：风扇、指示灯、蜂鸣器、舵机根据当前警报状态和活动状态动作
void updateActuators() {
  const DeviceControlState& controls = AliyunClient::controlState();
  updateFan(controls);
  updateLighting(controls);
  updateServoPosition(controls);
  updateBuzzerAlarm(controls);
}

const char* primaryAlarmText() {
  if (alarmState.coDanger) return "CO DANGER";
  if (alarmState.fallDetected) return "FALL DETECTED";
  if (alarmState.sos) return "SOS BUTTON";
  if (alarmState.smokeDanger) return "SMOKE DANGER";
  if (alarmState.airDanger) return "AIR DANGER";
  if (alarmState.smokeWarning) return "SMOKE WARNING";
  if (alarmState.coWarning) return "CO WARNING";
  if (alarmState.airWarning) return "AIR WARNING";
  if (alarmState.tempHumidity) return "TEMP/HUMID";
  if (alarmState.tempLow) return "TEMP LOW";
  if (alarmState.humidityLow) return "HUMID LOW";
  if (alarmState.vibration) return "VIBRATION";
  if (alarmState.pressure) return "PRESSURE";
  if (alarmState.noMotion) return "NO MOTION";
  if (activityState.nightActivity) return "NIGHT MOVE";
  return "NORMAL";
}

const char* dangerLevelText() {
  if (alarmState.coDanger) return "co_critical";
  if (alarmState.fallDetected || alarmState.sos) return "critical";
  if (alarmState.smokeDanger) return "danger";
  if (alarmState.airDanger) return "danger";
  if (alarmState.any) return "warning";
  if (activityState.nightActivity) return "activity";
  return "normal";
}

const char* fallStatusText() {
  return alarmState.fallDetected ? "YES" : "SAFE";
}

const char* airStatusText() {
  if (alarmState.airDanger) return "DANGER";
  if (alarmState.airWarning) return "WARN";
  return "OK";
}

const char* smokeStatusText() {
  if (alarmState.smokeDanger) return "DANGER";
  if (alarmState.smokeWarning) return "WARN";
  return "OK";
}

const char* coStatusText() {
  if (alarmState.coDanger) return "DANGER";
  if (alarmState.coWarning) return "WARN";
  return "OK";
}

struct DisplayAlert {
  const char* item = "";
  const char* level = "";
  const char* valueLabel = "";
  float value = NAN;
  const char* limitLabel = "";
  float limit = NAN;
  const char* unit = "";
  bool integerValue = false;
};

void addDisplayAlert(DisplayAlert* alerts,
                     uint8_t& count,
                     const char* item,
                     const char* level,
                     const char* valueLabel,
                     float value,
                     const char* limitLabel,
                     float limit,
                     const char* unit,
                     bool integerValue) {
  DisplayAlert& alert = alerts[count++];
  alert.item = item;
  alert.level = level;
  alert.valueLabel = valueLabel;
  alert.value = value;
  alert.limitLabel = limitLabel;
  alert.limit = limit;
  alert.unit = unit;
  alert.integerValue = integerValue;
}

uint8_t collectDisplayAlerts(DisplayAlert* alerts) {
  uint8_t count = 0;

  if (alarmState.coDanger) {
    addDisplayAlert(alerts, count, "MQ7 CO", "CRITICAL", "Value", data.mq7Raw,
                    "Limit", Mq7Config::DANGER_RAW, "", true);
  } else if (alarmState.coWarning) {
    addDisplayAlert(alerts, count, "MQ7 CO", "WARNING", "Value", data.mq7Raw,
                    "Limit", Mq7Config::WARN_RAW, "", true);
  }

  if (alarmState.smokeDanger) {
    addDisplayAlert(alerts, count, "MQ2 GAS", "DANGER", "Value", data.mq2Raw,
                    "Limit", Mq2Config::DANGER_RAW, "", true);
  } else if (alarmState.smokeWarning) {
    addDisplayAlert(alerts, count, "MQ2 GAS", "WARNING", "Value", data.mq2Raw,
                    "Limit", Mq2Config::WARN_RAW, "", true);
  }

  if (alarmState.airDanger) {
    addDisplayAlert(alerts, count, "MQ135 AIR", "DANGER", "Value", data.mq135Raw,
                    "Limit", Mq135Config::DANGER_RAW, "", true);
  } else if (alarmState.airWarning) {
    addDisplayAlert(alerts, count, "MQ135 AIR", "WARNING", "Value", data.mq135Raw,
                    "Limit", Mq135Config::WARN_RAW, "", true);
  }

  if (!isnan(data.temperatureC) && data.temperatureC >= Dht22Config::TEMP_HIGH_C) {
    addDisplayAlert(alerts, count, "TEMP HIGH", "WARNING", "Value", data.temperatureC,
                    "Limit", Dht22Config::TEMP_HIGH_C, "C", false);
  } else if (alarmState.tempLow) {
    addDisplayAlert(alerts, count, "TEMP LOW", "WARNING", "Value", data.temperatureC,
                    "Limit", Dht22Config::TEMP_LOW_C, "C", false);
  }

  if (!isnan(data.humidity) && data.humidity >= Dht22Config::HUMIDITY_HIGH_PERCENT) {
    addDisplayAlert(alerts, count, "HUMID HIGH", "WARNING", "Value", data.humidity,
                    "Limit", Dht22Config::HUMIDITY_HIGH_PERCENT, "%", false);
  } else if (alarmState.humidityLow) {
    addDisplayAlert(alerts, count, "HUMID LOW", "WARNING", "Value", data.humidity,
                    "Limit", Dht22Config::HUMIDITY_LOW_PERCENT, "%", false);
  }

  if (alarmState.fallDetected) {
    addDisplayAlert(alerts, count, "FALL", "CRITICAL", "State", 1,
                    "Need", 1, "", true);
  }

  if (alarmState.sos) {
    addDisplayAlert(alerts, count, "SOS BUTTON", "CRITICAL", "State", 1,
                    "Need", 1, "", true);
  }

  if (alarmState.pressure) {
    addDisplayAlert(alerts, count, "FSR PRESS", "WARNING", "Value", data.fsrRaw,
                    "Limit", Fsr402Config::PRESS_WARN_RAW, "", true);
  }

  if (alarmState.vibration) {
    addDisplayAlert(alerts, count, "VIBRATION", "WARNING", "State", 1,
                    "Need", 1, "", true);
  }

  if (alarmState.noMotion) {
    addDisplayAlert(alerts, count, "NO MOTION", "WARNING", "State", 1,
                    "Need", 1, "", true);
  }

