haohaoxinsheng/ESP32_ELDER_MONITOR/src/main.cpp
  return count;
}

void printDisplayValue(float value, const char* unit, bool integerValue) {
  if (isnan(value)) {
    display.print(F("--"));
  } else if (integerValue) {
    display.print(static_cast<uint16_t>(value));
  } else {
    display.print(value, 1);
  }
  display.print(unit);
}

void printCompactValue(float value, const char* unit, bool integerValue) {
  if (isnan(value)) {
    display.print(F("--"));
  } else if (integerValue) {
    display.print(static_cast<uint16_t>(value));
  } else {
    display.print(value, 0);
  }
  display.print(unit);
}

void drawHeader(const char* stateText) {
  display.setTextSize(1);
  display.setCursor(0, 0);
  display.print(F("HOME MONITOR"));
  display.setCursor(92, 0);
  display.print(stateText);
  display.drawFastHLine(0, 10, OledConfig::WIDTH, SSD1306_WHITE);
}

void drawEnvironmentStrip(uint8_t y) {
  display.setTextSize(1);
  display.setCursor(0, y);
  display.print(F("T "));
  if (isnan(data.temperatureC)) display.print(F("--"));
  else display.print(data.temperatureC, 1);
  display.print(F("C"));

  display.setCursor(47, y);
  display.print(F("H "));
  if (isnan(data.humidity)) display.print(F("--"));
  else display.print(data.humidity, 0);
  display.print(F("%"));

  display.setCursor(84, y);
  display.print(F("L "));
  if (isnan(data.lux)) display.print(F("--"));
  else display.print(data.lux, 0);
}

void drawFooterStatus(uint8_t y) {
  display.setTextSize(1);
  display.setCursor(0, y);
  display.print(F("PIR "));
  display.print(data.pirMotion ? F("MOVE") : F("STILL"));

  display.setCursor(66, y);
  display.print(F("B "));
  display.print(buzzerOn ? F("ON") : F("OFF"));

  display.setCursor(98, y);
  display.print(F("F "));
  display.print(fanOn ? F("ON") : F("OFF"));
}

// OLED 显示内容：0.96 寸 I2C 屏只展示关键状态，便于现场快速查看
void drawDisplay() {
  if (!oledOk) return;

  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);

  DisplayAlert alerts[12];
  const uint8_t alertCount = collectDisplayAlerts(alerts);

  if (alertCount == 0) {
    drawHeader("OK");
    drawEnvironmentStrip(14);

    display.setTextSize(2);
    display.setCursor(14, 28);
    display.print(F("NORMAL"));

    display.setTextSize(1);
    display.setCursor(23, 47);
    display.print(F("All readings safe"));
    drawFooterStatus(56);
    display.display();
    return;
  }

  const uint8_t index = (millis() / Timing::DISPLAY_PAGE_INTERVAL_MS) % alertCount;
  const DisplayAlert& alert = alerts[index];

  drawHeader(alert.level);

  display.setCursor(0, 13);
  display.print(index + 1);
  display.print(F("/"));
  display.print(alertCount);
  display.print(F(" "));
  display.print(alert.item);

  display.drawRect(0, 24, OledConfig::WIDTH, 28, SSD1306_WHITE);
  display.setTextSize(2);
  display.setCursor(6, 31);
  if (strcmp(alert.level, "CRITICAL") == 0) {
    display.print(F("CRITICAL"));
  } else if (strcmp(alert.level, "DANGER") == 0) {
    display.print(F("DANGER"));
  } else {
    display.print(F("WARNING"));
  }

  display.setTextSize(1);
  display.setCursor(0, 55);
  display.print(F("V "));
  printCompactValue(alert.value, alert.unit, alert.integerValue);
  display.setCursor(50, 55);
  display.print(F("L "));
  printCompactValue(alert.limit, alert.unit, alert.integerValue);
  display.setCursor(98, 55);
  display.print(F("B "));
  display.print(buzzerOn ? F("ON") : F("OFF"));

  display.display();
}

// 将当前传感器读数和状态输出到串口，便于调试和日志记录
void printSerialLog() {
  Serial.print(F("tempC="));
  Serial.print(data.temperatureC);
  Serial.print(F(",humidity="));
  Serial.print(data.humidity);
  Serial.print(F(",lux="));
  Serial.print(data.lux);
  Serial.print(F(",mq2="));
  Serial.print(data.mq2Raw);
  Serial.print(F(",mq135="));
  Serial.print(data.mq135Raw);
  Serial.print(F(",mq7="));
  Serial.print(data.mq7Raw);
  Serial.print(F(",fsr="));
  Serial.print(data.fsrRaw);
  Serial.print(F(",vibrationRaw="));
  Serial.print(data.vibrationRaw);
  Serial.print(F(",pir="));
  Serial.print(data.pirMotion);
  Serial.print(F(",dark="));
  Serial.print(activityState.dark);
  Serial.print(F(",nightActivity="));
  Serial.print(activityState.nightActivity);
  Serial.print(F(",vibration="));
  Serial.print(data.vibration);
  Serial.print(F(",sos="));
  Serial.print(data.sos);
  Serial.print(F(",fall="));
  Serial.print(alarmState.fallDetected);
  Serial.print(F(",level="));
  Serial.print(dangerLevelText());
  Serial.print(F(",alarm="));
  Serial.print(primaryAlarmText());
  Serial.print(F(",buzzer="));
  Serial.print(buzzerOn);
  Serial.print(F(",wifi="));
  Serial.print(AliyunClient::isWifiConnected());
  Serial.print(F(",mqtt="));
  Serial.println(AliyunClient::isMqttConnected());
}

// 组装待发送到云端的遥测数据包
TelemetryPayload buildTelemetryPayload() {
  TelemetryPayload payload;
  payload.temperatureC = data.temperatureC;
  payload.humidity = data.humidity;
  payload.lux = data.lux;
  payload.mq2Raw = data.mq2Raw;
  payload.mq135Raw = data.mq135Raw;
  payload.mq7Raw = data.mq7Raw;
  payload.fsrRaw = data.fsrRaw;
  payload.vibrationRaw = data.vibrationRaw;
  payload.pirMotion = data.pirMotion;
  payload.vibration = data.vibration;
  payload.sos = data.sos;
  payload.fallDetected = alarmState.fallDetected;
  payload.dark = activityState.dark;
  const DeviceControlState& controls = AliyunClient::controlState();
  payload.bedOccupied = isBedOccupied(controls);
  payload.nightWakeActive = controls.enablePir && activityState.dark && !payload.bedOccupied && data.pirMotion;
  payload.nightActivity = activityState.nightActivity;
  payload.alarmAny = alarmState.any;
  payload.pushRequired = alarmState.pushRequired;
  payload.fanOn = fanOn;
  payload.ledOn = ledOn;
  payload.darkLightOn = darkLightOn;
  payload.nightLightOn = nightLightOn;
  payload.nightWakeLightOn = nightWakeLightOn;
  payload.alarmLightOn = alarmLightOn;
  payload.dangerLevel = dangerLevelText();
  payload.alarmText = primaryAlarmText();
  return payload;
}

// 初始化引脚：输入传感器和输出执行器
void setupPins() {
  pinMode(PirConfig::OUT_PIN, INPUT);
  pinMode(Sw420Config::DOUT_PIN, INPUT);
  pinMode(SosButtonConfig::PIN, INPUT_PULLUP);
  pinMode(ActuatorConfig::BUZZER_PIN, OUTPUT);
  pinMode(ActuatorConfig::FAN_RELAY_PIN, OUTPUT);
  pinMode(ActuatorConfig::LED_LIGHT_PIN, OUTPUT);

  setBuzzer(false);
  digitalWrite(ActuatorConfig::FAN_RELAY_PIN, LOW);
  setLedLight(false);

  analogReadResolution(12);
  analogSetPinAttenuation(Mq2Config::AOUT_PIN, ADC_11db);
  analogSetPinAttenuation(Mq135Config::AOUT_PIN, ADC_11db);
  analogSetPinAttenuation(Mq7Config::AOUT_PIN, ADC_11db);
  analogSetPinAttenuation(Fsr402Config::AOUT_PIN, ADC_11db);
}

// 初始化外设设备：OLED、BH1750、DHT22、舵机
void setupDevices() {
  Wire.begin(OledConfig::SDA_PIN, OledConfig::SCL_PIN);
  oledOk = display.begin(SSD1306_SWITCHCAPVCC, OledConfig::I2C_ADDR);

