haohaoxinsheng/ESP32_ELDER_MONITOR/src/main.cpp
  bh1750Wire.begin(Bh1750Config::SDA_PIN, Bh1750Config::SCL_PIN);
  bh1750Ok = lightMeter.begin(BH1750::CONTINUOUS_HIGH_RES_MODE,
                              Bh1750Config::I2C_ADDR,
                              &bh1750Wire);
  dht.begin();

  servo.setPeriodHertz(50);
  servo.attach(ActuatorConfig::SERVO_PWM_PIN, 500, 2400);
  servo.write(ActuatorConfig::SERVO_NORMAL_ANGLE);

  if (oledOk) {
    display.clearDisplay();
    display.setTextColor(SSD1306_WHITE);
    display.setTextSize(1);
    display.setCursor(0, 0);
    display.println(F("Elder Monitor"));
    display.println(F("Booting..."));
    display.display();
  }
}

void updateFastState() {
  data.sos = AliyunClient::controlState().enableSos && buttonPressed();
  AliyunClient::loop();
  updateActivityState();
  updateAlarmState();
}

void runSensorTask(uint32_t now) {
  if (now - lastSensorReadMs < Timing::SENSOR_INTERVAL_MS) {
    return;
  }

  lastSensorReadMs = now;
  readSensors();
  updateActivityState();
  updateAlarmState();
  updateActuators();
}

void runDisplayTask(uint32_t now) {
  if (now - lastDisplayMs < Timing::DISPLAY_INTERVAL_MS) {
    return;
  }

  lastDisplayMs = now;
  drawDisplay();
}

void runSerialTask(uint32_t now) {
  if (now - lastSerialMs < Timing::SERIAL_INTERVAL_MS) {
    return;
  }

  lastSerialMs = now;
  printSerialLog();
}

void runCloudPublishTask(uint32_t now) {
  if (now - lastCloudPublishMs < CloudConfig::CLOUD_PUBLISH_INTERVAL_MS) {
    return;
  }

  lastCloudPublishMs = now;
  AliyunClient::publishTelemetry(buildTelemetryPayload());
}
}  // namespace

void setup() {
  // 初始化串口与硬件外设，并启动阿里云客户端
  Serial.begin(115200);
  delay(200);
  OnboardRgbStatus::showUploadStarting();
  setupPins();
  setupDevices();
  AliyunClient::begin();
  OnboardRgbStatus::showUploadSuccess();
  lastMotionMs = millis();
  Serial.println(F("ESP32 elder monitor started."));
  Serial.print(F("OLED="));
  Serial.print(oledOk ? F("OK") : F("FAIL"));
  Serial.print(F(", BH1750="));
  Serial.println(bh1750Ok ? F("OK") : F("FAIL"));
}

void loop() {
  const uint32_t now = millis();
  updateFastState();
  runSensorTask(now);
  runDisplayTask(now);
  runSerialTask(now);
  runCloudPublishTask(now);
  updateActuators();
}
